{
  "earthquake": {
    "dos": [
      "Drop, Cover, and Hold On if you're indoors during shaking",
      "Stay away from windows, mirrors, and heavy objects that could fall",
      "If outdoors, move to an open area away from buildings, trees, and power lines",
      "After shaking stops, check for injuries and damage",
      "Listen to emergency broadcasts for instructions",
      "Be prepared for aftershocks",
      "Turn off gas if you smell it or suspect a leak",
      "Use stairs, not elevators when evacuating buildings",
      "Keep emergency supplies ready: water, food, first aid kit, flashlight",
      "Have a family communication plan",
      "Secure heavy furniture and appliances to walls before earthquakes",
      "Practice earthquake drills regularly with family",
      "Keep a whistle to signal rescuers if trapped",
      "Wear sturdy shoes to protect feet from broken glass",
      "Check water, gas, and electric lines for damage",
      "Keep important documents in earthquake-proof container",
      "Stock at least 3-day supply of water (1 gallon per person per day)",
      "Have battery-powered or hand-crank radio",
      "Learn how to shut off utilities at main valves",
      "Identify safe spots in each room (under sturdy table, against inside wall)"
    ],
    "donts": [
      "Don't run outside during shaking - most injuries occur from falling objects",
      "Don't use elevators during or after an earthquake",
      "Don't light matches or use lighters if gas leak is suspected",
      "Don't use your phone except for emergencies - keep lines clear",
      "Don't spread or believe rumors - rely on official sources only",
      "Don't enter damaged buildings",
      "Don't touch downed power lines or objects touching them",
      "Don't use your vehicle unless absolutely necessary",
      "Don't panic - stay calm and think clearly",
      "Don't stand near unstable structures or debris",
      "Don't use candles or open flames after an earthquake",
      "Don't flush toilets if sewage lines may be damaged",
      "Don't eat food from opened containers near broken glass",
      "Don't go sightseeing in damaged areas",
      "Don't leave children or pets alone after earthquake",
      "Don't ignore evacuation orders from authorities",
      "Don't overload electrical outlets after power restoration",
      "Don't drink water that may be contaminated",
      "Don't move seriously injured persons unless they're in immediate danger",
      "Don't assume it's over after the first shake - expect aftershocks"
    ],
    "specific_situations": {
      "indoors": "Drop to ground, take cover under sturdy table, hold on until shaking stops. Stay away from windows and outside walls.",
      "outdoors": "Move away from buildings, trees, streetlights, and power lines. Drop to ground and stay there until shaking stops.",
      "in_vehicle": "Pull over to clear location away from buildings, trees, overpasses. Stay inside with seatbelt on. Don't drive over bridges or ramps that may be damaged.",
      "in_bed": "Stay in bed and cover your head with pillow. You're less likely to be injured by flying debris if you stay put.",
      "in_stadium": "Stay in your seat and protect head with arms. Don't rush for exits - wait until shaking stops.",
      "trapped_under_debris": "Don't light matches. Don't move or kick up dust. Cover mouth with cloth. Tap on pipes or walls. Use whistle if available.",
      "near_ocean": "Move to higher ground immediately after shaking - tsunami may follow. Don't return to coast until all-clear given.",
      "in_wheelchair": "Lock wheels, cover head and neck. If possible, move away from windows and shelves. Stay in wheelchair.",
      "in_elevator": "If shaking starts, push all floor buttons. Get out at first stop. Take stairs, not elevator. If trapped, call for help.",
      "in_store": "Move away from aisles where items could fall. Take cover under sturdy furniture or in doorway. Don't rush to exits."
    },
    "preparation": [
      "Secure water heaters and gas appliances with flexible connections",
      "Install strong latches on cabinets",
      "Place heavy items on lower shelves",
      "Bolt bookcases and file cabinets to wall studs",
      "Have earthquake insurance if in seismic zone",
      "Create family emergency communication plan with out-of-state contact",
      "Teach all family members how to turn off gas, water, electricity",
      "Keep fire extinguisher and know how to use it",
      "Maintain emergency supply kit in accessible location",
      "Know safest spots in each room of your home"
    ],
    "aftermath": [
      "Expect aftershocks - they can be strong and cause additional damage",
      "Check yourself and others for injuries",
      "Inspect home for cracks, damage before entering",
      "Clean up spilled medicines, bleach, gasoline immediately",
      "Open cabinets cautiously - contents may fall",
      "Check gas, electric, and water lines for damage",
      "Document property damage with photos for insurance",
      "Contact insurance agent to file claim",
      "Register with disaster relief services if needed",
      "Help neighbors who may need assistance, especially elderly or disabled"
    ]
  },
  "flood": {
    "dos": [
      "Move to higher ground immediately if flooding is expected",
      "Evacuate if told to do so by authorities",
      "Keep important documents in waterproof containers",
      "Turn off utilities at main switches if instructed",
      "Bring outdoor belongings inside or tie them down",
      "Fill bathtubs and sinks with clean water as a reserve",
      "Monitor weather updates and emergency broadcasts",
      "Stay out of floodwater - it may be contaminated or electrically charged",
      "Use a stick to check ground firmness if you must walk in water",
      "Wear protective clothing and boots if exposed to floodwater",
      "Know your area's flood risk and evacuation routes",
      "Have emergency kit ready with food, water, medications for 3 days",
      "Keep car fuel tank full during flood season",
      "Purchase flood insurance well before flood season",
      "Store emergency supplies on higher floors",
      "Listen to NOAA Weather Radio for flood warnings",
      "Install check valves in plumbing to prevent backflow",
      "Consider building walls or barriers around your property",
      "Elevate electrical panel, appliances, heating system",
      "Take photos of home and belongings for insurance purposes"
    ],
    "donts": [
      "Don't walk, swim, or drive through floodwater - just 6 inches can knock you down",
      "Don't drive around barricades - they're there for your safety",
      "Don't touch electrical equipment if wet or standing in water",
      "Don't eat food that has been in contact with floodwater",
      "Don't return home until authorities say it's safe",
      "Don't ignore evacuation orders",
      "Don't underestimate the power of moving water",
      "Don't let children play in or near floodwater",
      "Don't drink floodwater or use it for washing without purification",
      "Don't camp or park near streams or rivers during heavy rainfall",
      "Don't walk on ice covering floodwater",
      "Don't attempt to move heavy debris",
      "Don't use gas or electrical appliances until inspected",
      "Don't handle wild animals displaced by flooding",
      "Don't enter flooded basements without proper safety equipment",
      "Don't assume flood is over when water begins to recede",
      "Don't forget about flood threat even if you're not in floodplain",
      "Don't delay evacuation - floods can rise rapidly",
      "Don't use camping stoves or generators indoors",
      "Don't swim in floodwater due to hidden hazards and contamination"
    ],
    "specific_situations": {
      "flash_flood_warning": "Take immediate action. Flash floods are extremely dangerous. Abandon vehicle if trapped. Climb to high ground.",
      "in_vehicle": "Turn around, don't drown. Don't drive through flooded roads. If car stalls, abandon it immediately and move to higher ground.",
      "basement_flooding": "Don't enter until power is shut off. Pump water slowly to prevent structural damage. Wear rubber boots and gloves.",
      "contaminated_water": "Boil water for 1 minute before drinking. Use bleach to disinfect (8 drops per gallon). Don't use contaminated water for brushing teeth.",
      "rapid_rise_water": "Don't wait for official warning. If water is rising rapidly, go to highest floor or roof. Signal for help.",
      "after_flood": "Don't enter building until declared safe. Check for structural damage. Document damage with photos. Begin drying within 24-48 hours to prevent mold.",
      "urban_flooding": "Storm drains may overflow. Underground parking floods quickly. Elevators can become death traps. Move to higher floors.",
      "coastal_flooding": "Storm surge can arrive before hurricane. Move inland, not just to higher floors. Don't return until all-clear signal.",
      "river_flooding": "Water rises more predictably than flash floods. Still deadly. Evacuate when told. Don't attempt to cross flowing streams.",
      "mudslide_risk": "Saturated ground on slopes can give way. Listen for rumbling sounds. Move perpendicular to mudslide path if possible."
    },
    "preparation": [
      "Know your flood zone and evacuation routes",
      "Keep sump pump maintained with backup power",
      "Install water sensors in basement and crawl spaces",
      "Grade landscaping away from foundation",
      "Install backflow valves in building sewer lines",
      "Keep sandbags, plywood, plastic sheeting available",
      "Elevate utilities and appliances above potential flood levels",
      "Anchor fuel tanks to prevent flotation",
      "Review and understand flood insurance policy",
      "Create digital copies of important documents"
    ],
    "health_risks": [
      "Waterborne diseases from contaminated water",
      "Carbon monoxide poisoning from generators",
      "Electrical hazards from downed power lines",
      "Physical injuries from debris",
      "Mold exposure after flooding",
      "Chemical contamination from industrial sites",
      "Wild animal encounters",
      "Hypothermia from cold water exposure",
      "Stress and mental health impacts",
      "Mosquito-borne illnesses in standing water"
    ]
  },
  "fire": {
    "dos": [
      "Alert others immediately by shouting 'Fire!' and activating fire alarms",
      "Call emergency services (911) as soon as possible",
      "Evacuate immediately - leave belongings behind",
      "Feel doors before opening - if hot, use another escape route",
      "Crawl low under smoke to breathe cleaner air",
      "Close doors behind you to slow fire spread",
      "Use stairs, never elevators during a fire",
      "Go to your designated meeting point once outside",
      "If clothes catch fire: Stop, Drop, and Roll",
      "Use a fire extinguisher only if you're trained and the fire is small",
      "Install smoke alarms on every level and in bedrooms",
      "Test smoke alarms monthly and replace batteries yearly",
      "Plan and practice two escape routes from every room",
      "Keep bedroom doors closed at night for protection",
      "Store flammable materials properly away from heat sources",
      "Have fire extinguisher accessible in kitchen and garage",
      "Install fire sprinklers in your home if possible",
      "Keep emergency ladder for upper floors",
      "Teach children how to escape and not to hide",
      "Have working flashlights in easily accessible locations"
    ],
    "donts": [
      "Don't go back inside for any reason once you've evacuated",
      "Don't try to fight a large fire yourself",
      "Don't open doors without checking if they're hot first",
      "Don't use elevators during a fire",
      "Don't hide - evacuate immediately",
      "Don't breathe smoke - cover nose and mouth with cloth if possible",
      "Don't run if clothing catches fire - Stop, Drop, and Roll",
      "Don't waste time gathering belongings",
      "Don't break windows unless absolutely necessary for escape",
      "Don't use water on electrical or grease fires",
      "Don't paint over or disable smoke alarms",
      "Don't overload electrical outlets or extension cords",
      "Don't leave cooking unattended",
      "Don't smoke in bed or near flammable materials",
      "Don't store gasoline or propane indoors",
      "Don't block fire exits or escape routes",
      "Don't use damaged electrical cords or appliances",
      "Don't leave candles unattended",
      "Don't ignore strange electrical smells or sparks",
      "Don't delay evacuation to investigate fire source"
    ],
    "specific_situations": {
      "kitchen_fire": "If fire in pan, slide lid over it. Turn off burner. Don't move pan. Don't use water on grease fire. Use fire extinguisher if trained.",
      "electrical_fire": "Never use water. Turn off power if safe. Use Class C fire extinguisher. Call 911 immediately.",
      "clothing_fire": "Stop immediately. Drop to ground. Roll back and forth to smother flames. Cover face with hands. Cool burns with water.",
      "trapped_in_room": "Close door. Seal cracks with clothing or towels. Signal from window. Call 911 and tell them your location. Stay low where air is clearer.",
      "smoke_filled_building": "Crawl low under smoke. Cover nose and mouth with wet cloth if possible. Feel doors before opening. Take alternate route if door is hot.",
      "apartment_fire": "Alert neighbors. Close your door. Use stairs, not elevator. If you can't exit, seal door and call for help from window.",
      "wildfire_approaching": "Evacuate early. Don't wait for orders. Close all windows and doors. Remove flammable materials from around house. Bring pets inside or evacuate with them.",
      "office_fire": "Know locations of fire alarms and exits. Alert others. Use nearest safe exit. Assist those who need help. Go to assembly point.",
      "vehicle_fire": "Pull over safely. Turn off engine. Get everyone out. Move 100+ feet away. Call 911. Don't open hood if fire in engine compartment.",
      "holiday_fire": "Water Christmas tree daily. Keep away from heat. Turn off lights when leaving. Use LED lights. Don't burn wrapping paper in fireplace."
    },
    "fire_types": {
      "class_a": "Ordinary combustibles (wood, paper, cloth). Use water or ABC extinguisher.",
      "class_b": "Flammable liquids (gasoline, oil, grease). Don't use water. Use foam or ABC extinguisher.",
      "class_c": "Electrical fires. Turn off power first. Use CO2 or ABC extinguisher. Never use water.",
      "class_d": "Metal fires. Use Class D extinguisher designed for specific metal.",
      "class_k": "Kitchen fires (cooking oils, fats). Use Class K extinguisher or baking soda for small fires."
    },
    "fire_extinguisher_use": {
      "pass_method": "Pull pin, Aim at base of fire, Squeeze handle, Sweep side to side",
      "when_to_use": "Only if fire is small, contained, not spreading rapidly, and you have clear escape route",
      "when_not_to_use": "If fire is large, spreading, smoke-filled room, or you're not trained",
      "maintenance": "Check pressure gauge monthly. Inspect for damage. Professional service annually."
    },
    "smoke_inhalation": [
      "Smoke is the leading cause of fire deaths",
      "Get low and go - cleaner air is near floor",
      "Hold breath when moving through smoke if possible",
      "Cover nose and mouth with damp cloth",
      "Seek medical attention after any smoke exposure",
      "Symptoms: coughing, difficulty breathing, confusion, loss of consciousness",
      "Carbon monoxide poisoning risk - odorless and deadly",
      "Soot and particles damage lungs",
      "Children and elderly most vulnerable",
      "Any smoke inhalation requires medical evaluation"
    ]
  },
  "hurricane": {
    "dos": [
      "Evacuate if ordered by authorities",
      "Board up windows or close storm shutters",
      "Bring outdoor furniture and decorations inside",
      "Stock up on emergency supplies: water, food, batteries, medications",
      "Fill your vehicle's gas tank",
      "Charge all electronic devices",
      "Know your evacuation route and have a plan",
      "Stay indoors during the hurricane in a secure room away from windows",
      "Monitor weather updates continuously",
      "Have cash on hand - ATMs may not work after the storm",
      "Fill bathtub and containers with water for reserve",
      "Store important documents in waterproof container",
      "Take photos of home and property before storm",
      "Turn refrigerator to coldest setting and don't open unnecessarily",
      "Prepare a safe room in interior of house on first floor",
      "Have multiple ways to receive weather warnings",
      "Ensure you have adequate insurance coverage",
      "Plan for pet evacuation or shelter in place",
      "Trim trees and shrubs before hurricane season",
      "Reinforce garage doors to withstand high winds"
    ],
    "donts": [
      "Don't ignore evacuation orders",
      "Don't use candles during the storm - use flashlights instead",
      "Don't go outside during the 'eye' of the hurricane - winds will resume",
      "Don't use generators indoors - they produce deadly carbon monoxide",
      "Don't tape windows in an 'X' pattern - this doesn't prevent breakage",
      "Don't wait until the last minute to prepare",
      "Don't drive through standing or moving water",
      "Don't touch downed power lines",
      "Don't use the phone except for emergencies",
      "Don't open refrigerator or freezer unnecessarily during power outage",
      "Don't leave pets behind if you evacuate",
      "Don't rely on a single weather information source",
      "Don't forget to secure or bring in trampolines, grills, and outdoor items",
      "Don't underestimate storm surge - it's often the deadliest aspect",
      "Don't attempt to drive across flooded roads or bridges",
      "Don't assume the storm is over when wind dies down - eye may be passing",
      "Don't go sightseeing during or after storm",
      "Don't use open flames for light or cooking during storm",
      "Don't forget medication and medical equipment",
      "Don't leave home without emergency supplies if evacuating"
    ],
    "categories": {
      "category_1": "74-95 mph winds. Very dangerous winds causing some damage. Power outages. Minor roof damage.",
      "category_2": "96-110 mph winds. Extremely dangerous winds. Major roof and siding damage. Power outages for days to weeks.",
      "category_3": "111-129 mph winds. Devastating damage. Roof decking damage. Many trees snapped. Power and water outages for weeks.",
      "category_4": "130-156 mph winds. Catastrophic damage. Roof structures destroyed. Most trees snapped. Long-term power outages.",
      "category_5": "157+ mph winds. Catastrophic damage. Total roof failure. Complete destruction of homes. Area uninhabitable for weeks to months."
    },
    "storm_surge": {
      "danger": "Storm surge is often the greatest threat. It's an abnormal rise of water generated by storm's winds.",
      "impact": "Can reach heights of 20+ feet and extend inland for miles. Causes catastrophic damage and drowning deaths.",
      "warning_signs": "Rapidly rising water, especially in coastal areas. Don't wait to see it - evacuate when ordered.",
      "safety": "Evacuate from storm surge zones. Move inland, not just to higher floors. Water can rise rapidly.",
      "after_surge": "Don't return until authorities declare it safe. Floodwater may be contaminated. Roads may be damaged."
    },
    "preparation_timeline": {
      "36_hours_before": "Review plans. Check supplies. Charge devices. Monitor forecasts. Secure outdoor items.",
      "24_hours_before": "Evacuate if ordered. Fill gas tank. Get cash. Stock up on supplies. Board windows.",
      "12_hours_before": "Turn fridge to coldest. Fill bathtubs with water. Locate safe room. Stay indoors. Continuous monitoring.",
      "6_hours_before": "Final preparations. Move to safe room. Keep family together. Emergency supplies accessible.",
      "during_storm": "Stay inside. Away from windows. Listen to updates. Don't go out during eye. Wait for all-clear."
    },
    "after_hurricane": [
      "Don't return home until authorities say it's safe",
      "Watch for downed power lines and flooding",
      "Document damage with photos for insurance",
      "Check for gas leaks, structural damage before entering home",
      "Use caution with food - discard anything that may have spoiled",
      "Avoid driving unless necessary - roads may be damaged",
      "Beware of wild animals and displaced snakes",
      "Continue monitoring weather for additional storms",
      "Register with FEMA for disaster assistance if needed",
      "Help neighbors who may need assistance"
    ]
  },
  "tornado": {
    "dos": [
      "Seek shelter immediately in a basement or interior room on the lowest floor",
      "Get under sturdy furniture and protect your head and neck with your arms",
      "Stay away from windows, doors, and outside walls",
      "In a vehicle or mobile home, get out and seek shelter in a building or lie flat in a ditch",
      "Listen to NOAA Weather Radio or local news for updates",
      "Have a tornado emergency kit ready",
      "Wear sturdy shoes and protective clothing",
      "Keep a battery-powered radio and flashlight handy",
      "Practice tornado drills with your family",
      "Know the signs: dark greenish sky, large hail, loud roar",
      "Have multiple ways to receive tornado warnings",
      "Identify safe shelter locations at home, work, and school",
      "Keep emergency supplies in your safe room",
      "Cover yourself with mattress or blankets for protection",
      "Install a safe room or storm shelter if in tornado-prone area",
      "Keep shoes and phone near bed for nighttime warnings",
      "Sign up for local emergency alerts",
      "Have a family communication plan",
      "Know the difference between watch (conditions favorable) and warning (tornado spotted)",
      "Wear helmets for added head protection if available"
    ],
    "donts": [
      "Don't stay in a mobile home during a tornado",
      "Don't try to outrun a tornado in your vehicle in urban areas",
      "Don't take shelter under highway overpasses",
      "Don't open windows - this wastes valuable time",
      "Don't stay in large open rooms like gyms or auditoriums",
      "Don't ignore tornado warnings",
      "Don't go outside to watch or photograph the tornado",
      "Don't use elevators during a tornado warning",
      "Don't wait to see the tornado before taking shelter",
      "Don't leave your shelter until the danger has passed and authorities give all-clear",
      "Don't lie flat in an overpass - debris can be deadly",
      "Don't rely solely on sirens - they may not work or be audible",
      "Don't huddle near exterior walls",
      "Don't forget about pets - bring them to shelter",
      "Don't assume you're safe because sky looks clear",
      "Don't drive through areas with active tornado warnings",
      "Don't use landline phones during storm (risk of lightning strike)",
      "Don't delay taking shelter to gather non-essential items",
      "Don't go into damaged buildings after tornado",
      "Don't touch downed power lines or debris touching them"
    ],
    "specific_locations": {
      "home_with_basement": "Go to basement immediately. Get under workbench or stairs. Avoid areas under heavy objects on floor above.",
      "home_no_basement": "Go to interior room on lowest floor (bathroom, closet, hallway). Get in bathtub if possible. Cover with mattress.",
      "mobile_home": "LEAVE IMMEDIATELY. Go to designated shelter or permanent structure. If no shelter, lie flat in ditch and cover head.",
      "school": "Go to designated shelter area. Interior hallway on lowest floor. Crouch low and cover head. Stay away from gymnasiums and cafeterias.",
      "office_building": "Go to interior rooms, hallways on lowest floor. Stay away from windows and elevators. Get under desk or table.",
      "shopping_mall": "Move to interior small shops or storage rooms. Avoid large open spaces. Get low and protect head.",
      "vehicle": "If possible, drive to nearest sturdy shelter. If tornado is close, abandon vehicle and lie flat in ditch. Don't shelter under overpass.",
      "outdoors": "Seek lowest ground available (ditch, ravine). Lie flat and cover head with hands. Watch for flash flooding.",
      "church": "Avoid large spaces with wide-span roofs. Go to interior rooms or hallways if possible. Get under pews if no other option.",
      "high_rise": "Can't reach lowest floor? Go to interior stairwell or small room on lowest floor accessible. Stay away from windows."
    },
    "warning_signs": [
      "Dark, often greenish sky",
      "Wall cloud or lowering clouds",
      "Large, dark, low-lying clouds",
      "Large hail or heavy rain followed by calm or fast wind shift",
      "Loud roar similar to freight train",
      "Visible rotating funnel cloud",
      "Debris falling from sky",
      "Sudden calm after violent weather",
      "Persistent rotation in cloud base",
      "Flying debris even without visible funnel"
    ],
    "after_tornado": [
      "Check yourself and others for injuries",
      "Be alert for additional tornadoes",
      "Watch for hazards: broken glass, nails, sharp objects",
      "Don't enter damaged buildings until inspected",
      "Avoid downed power lines and broken gas lines",
      "Document damage for insurance claims",
      "Contact family to let them know you're safe",
      "Listen to authorities for recovery information",
      "Take photos of damage before cleanup",
      "Register with disaster relief if needed"
    ]
  },
  "winter_storm": {
    "dos": [
      "Stay indoors during severe winter storms",
      "Have emergency supplies: food, water, medications for 3-7 days",
      "Keep extra blankets, warm clothing accessible",
      "Insulate pipes to prevent freezing",
      "Let faucets drip slightly during extreme cold",
      "Keep rock salt or sand for icy walkways",
      "Have alternative heating source (fireplace, generator) with proper ventilation",
      "Keep car gas tank at least half full",
      "Store snow shovels, ice scrapers in accessible location",
      "Monitor weather forecasts continuously",
      "Check on elderly neighbors during severe weather",
      "Keep cell phone charged",
      "Clear snow from dryer vent, furnace vent",
      "Know signs of hypothermia and frostbite",
      "Dress in layers if going outside",
      "Protect pets from extreme cold",
      "Have flashlights with extra batteries",
      "Keep fire extinguisher accessible",
      "Close doors to unused rooms to conserve heat",
      "Have carbon monoxide detector working"
    ],
    "donts": [
      "Don't travel unless absolutely necessary",
      "Don't use gas stove or oven to heat home",
      "Don't use generator, grill, or camp stove indoors",
      "Don't ignore power line damage or downed lines",
      "Don't leave water running continuously (unless to prevent freezing)",
      "Don't go outside during blizzard conditions",
      "Don't overexert yourself shoveling snow",
      "Don't leave pets outside in extreme cold",
      "Don't rely on space heaters as primary heat source",
      "Don't leave candles unattended",
      "Don't drive during ice storms",
      "Don't walk on frozen ponds or lakes without safety check",
      "Don't forget about pipes in unheated areas",
      "Don't ignore warning signs of carbon monoxide poisoning",
      "Don't remove all snow from roof without professional help if heavy accumulation",
      "Don't drink alcohol to stay warm - it actually increases heat loss",
      "Don't bring snow blower or generator indoors",
      "Don't ignore frostbite symptoms",
      "Don't let children play near snowplows",
      "Don't assume roads are safe when storm appears over"
    ],
    "frostbite": {
      "symptoms": "Numbness, white or grayish-yellow skin, unusually firm or waxy skin",
      "areas_affected": "Fingers, toes, nose, ears, cheeks, chin most vulnerable",
      "treatment": "Get to warm place. Immerse in warm (not hot) water. Don't rub affected area. Seek medical attention.",
      "prevention": "Dress in layers. Cover all exposed skin. Keep dry. Take breaks from cold. Watch for symptoms."
    },
    "hypothermia": {
      "symptoms": "Shivering, exhaustion, confusion, fumbling hands, memory loss, slurred speech, drowsiness",
      "danger": "Life-threatening. Body temperature drops below 95°F. Can cause death.",
      "treatment": "Get to warm place. Remove wet clothing. Warm center of body first. Give warm beverages if conscious. Seek medical help immediately.",
      "prevention": "Stay dry. Dress in layers. Eat adequately. Avoid alcohol. Stay active but don't overexert."
    },
    "frozen_pipes": {
      "prevention": "Insulate pipes. Keep cabinet doors open. Let faucets drip. Maintain temperature above 55°F even when away.",
      "signs": "Little or no water flow. Frost on pipes. Strange odors from drains.",
      "action": "Keep faucet open. Apply heat to frozen section (hair dryer, heating pad). Never use open flame. Call plumber if can't locate or thaw.",
      "burst_pipe": "Shut off main water valve immediately. Call plumber. Document damage for insurance."
    }
  },
  "tsunami": {
    "dos": [
      "Move to high ground immediately if you feel strong earthquake near coast",
      "Evacuate quickly if you hear tsunami warning",
      "Head inland or to highest ground available - at least 100 feet above sea level or 2 miles inland",
      "Take emergency kit with you if time permits",
      "Listen to emergency officials' instructions",
      "Stay away from beach, harbor, marina, and rivers after earthquake",
      "Recognize natural warnings: earthquake, sudden ocean withdrawal, loud ocean roar",
      "Continue moving inland or upward until all-clear given",
      "Help others who need assistance if it doesn't delay your evacuation",
      "Know tsunami evacuation routes in coastal areas you visit",
      "Sign up for tsunami warnings through local emergency management",
      "Understand tsunami hazard level of area where you live, work, visit",
      "Practice tsunami evacuation routes",
      "Teach family members tsunami warning signs",
      "Have multiple evacuation routes planned",
      "Keep emergency supplies ready in coastal areas",
      "Stay informed about tsunami science and preparedness",
      "Participate in TsunamiReady community programs if available",
      "Monitor ocean behavior before swimming or boating after earthquake",
      "Keep vehicle fueled in tsunami zones during earthquake season"
    ],
    "donts": [
      "Don't wait for official warning if you observe natural tsunami signs",
      "Don't go to shore to watch tsunami",
      "Don't return to coast until all-clear signal given by authorities",
      "Don't assume one wave is all - tsunamis are series of waves",
      "Don't stay in low-lying coastal areas after strong earthquake",
      "Don't approach animals displaced by tsunami",
      "Don't enter damaged buildings",
      "Don't touch downed power lines",
      "Don't drive through tsunami zone during warning",
      "Don't assume you're safe because first wave was small",
      "Don't go back for belongings - your life is more valuable",
      "Don't underestimate tsunami force - even small waves are powerful",
      "Don't forget about pets - but don't delay evacuation for them",
      "Don't ignore evacuation routes and signs",
      "Don't assume all beaches are affected equally",
      "Don't swim, surf, or boat during tsunami warning",
      "Don't stay in marina or harbor",
      "Don't think you can outrun a tsunami - evacuate early",
      "Don't assume high-rise hotels on beach are safe",
      "Don't let curiosity endanger your life"
    ],
    "natural_warning_signs": [
      "Strong earthquake lasting 20 seconds or more near coast",
      "Rapid rise or fall of coastal waters",
      "Loud ocean roar",
      "Ocean receding dramatically, exposing sea floor",
      "Approaching wall of water",
      "Multiple earthquake aftershocks",
      "Unusual ocean behavior",
      "Strong current or rapid tide change",
      "Floating debris in unusual patterns",
      "Ground shaking that makes it hard to stand"
    ],
    "evacuation": {
      "immediate_action": "Drop your belongings. Move immediately to high ground or inland.",
      "on_foot": "Often fastest method. Know walking evacuation routes. Head uphill perpendicular to shore.",
      "by_vehicle": "Only if clear route to high ground. Don't get stuck in traffic. Be prepared to abandon vehicle and run.",
      "vertical_evacuation": "If can't reach high ground, go to upper floors of reinforced concrete building as last resort.",
      "after_first_wave": "Don't return. Subsequent waves may be larger. Stay in safe area for hours after last wave.",
      "with_pets": "Take if immediately available. Don't delay evacuation searching for pets.",
      "assist_others": "Help those who need assistance if possible without delaying your evacuation.",
      "assembly_points": "Know designated gathering areas. Report to authorities that you're safe."
    },
    "zones": {
      "red_zone": "Highest risk. Immediate evacuation required. Within minutes of wave arrival after earthquake.",
      "orange_zone": "High risk. Evacuate quickly. 10-30 minutes potential warning time.",
      "yellow_zone": "Moderate risk. Be prepared to evacuate. May have 30+ minutes warning time.",
      "inundation_zone": "Area potentially affected by tsunami. Know if you live/work in this zone."
    }
  },
  "wildfire": {
    "dos": [
      "Evacuate immediately when ordered - don't wait",
      "Monitor local news and emergency alerts continuously",
      "Prepare evacuation kit with documents, photos, medications",
      "Create defensible space around home - clear vegetation 30+ feet",
      "Have multiple evacuation routes planned",
      "Keep car facing outward in driveway with keys inside",
      "Close all windows and doors when evacuating",
      "Remove flammable materials from around house",
      "Wet roof and shrubs if time permits before evacuating",
      "Wear protective clothing: long sleeves, pants, boots",
      "Take pets with you when evacuating",
      "Leave lights on so firefighters can see house through smoke",
      "Shut off gas at meter",
      "Close all interior doors to prevent draft",
      "Open fireplace damper, close fireplace screen",
      "Know fire danger level in your area daily during fire season",
      "Have N95 masks for smoke protection",
      "Sign up for emergency alerts in your area",
      "Create photo/video inventory of home and belongings",
      "Know location of emergency shelters"
    ],
    "donts": [
      "Don't delay evacuation",
      "Don't go back for belongings",
      "Don't drive through heavy smoke",
      "Don't use water to fight wildfire - evacuate instead",
      "Don't ignore evacuation orders",
      "Don't assume your property is safe from fire",
      "Don't block roads needed by emergency vehicles",
      "Don't leave pets behind",
      "Don't forget to close windows and doors",
      "Don't leave flammable materials outside",
      "Don't wait to see flames before evacuating",
      "Don't panic - follow evacuation plan",
      "Don't drive over power lines",
      "Don't stop to take photos or video",
      "Don't re-enter area until authorities declare it safe",
      "Don't use BBQ or outdoor flames during fire season",
      "Don't dispose of cigarettes improperly",
      "Don't use equipment that creates sparks on hot, dry days",
      "Don't park on dry grass",
      "Don't assume fire won't reach your area"
    ],
    "preparation": [
      "Create 30-foot defensible space around home",
      "Use fire-resistant materials for roof and exterior",
      "Install dual-pane windows to reduce heat transfer",
      "Screen vents with 1/8-inch mesh",
      "Keep gutters clean of leaves and debris",
      "Trim tree branches at least 10 feet from roof",
      "Remove dead vegetation and leaves regularly",
      "Store firewood at least 30 feet from home",
      "Have garden hoses long enough to reach any area of property",
      "Install fire sprinklers if possible",
      "Have fire extinguishers and know how to use them",
      "Create digital copies of important documents",
      "Have evacuation kit ready to grab",
      "Plan evacuation routes and practice them",
      "Designate meeting place away from fire zone"
    ]
  },
  "heat_wave": {
    "dos": [
      "Stay in air-conditioned buildings as much as possible",
      "Drink plenty of water even if not thirsty",
      "Wear lightweight, light-colored, loose-fitting clothing",
      "Take cool showers or baths",
      "Check on elderly, sick, or frail family, friends, neighbors",
      "Limit outdoor activities to early morning or evening",
      "Use sunscreen SPF 15 or higher",
      "Know signs of heat exhaustion and heat stroke",
      "Never leave children or pets in vehicles",
      "Use public cooling centers if home lacks AC",
      "Cover windows with curtains or blinds",
      "Eat light, cool meals",
      "Stay on lowest floor of building if AC fails",
      "Monitor local weather and heat advisories",
      "Take frequent breaks if working outside",
      "Wear wide-brimmed hats when outdoors",
      "Stay informed about extreme heat warnings",
      "Have emergency numbers readily available"
    ],
    "donts": [
      "Don't leave anyone in parked vehicle",
      "Don't consume excessive alcohol or caffeine",
      "Don't take salt tablets unless doctor prescribed",
      "Don't forget about pets - they need water and shade",
      "Don't exercise in extreme heat",
      "Don't wear dark colors in sun",
      "Don't ignore signs of heat illness",
      "Don't use stove or oven if possible",
      "Don't close all windows if no AC available",
      "Don't assume you're safe just because you're young and healthy"
    ],
    "heat_illness": {
      "heat_cramps": "Symptoms: Muscle pain, spasms. Treatment: Stop activity, drink water, rest in cool place.",
      "heat_exhaustion": "Symptoms: Heavy sweating, weakness, cold/clammy skin, fast pulse, nausea. Treatment: Move to cool place, loosen clothes, sip water, cool with wet cloths. Seek medical help if symptoms worsen.",
      "heat_stroke": "Symptoms: High body temp (103°F+), hot/dry skin, rapid pulse, confusion, unconsciousness. LIFE-THREATENING. Call 911 immediately. Move to cool place, cool with whatever available, don't give fluids."
    }
  }
}
